In [227]:
import pandas as pd

In [152]:
dict_data = {'a': 1, 'b': 2, 'c': 3}
sr = pd.Series(dict_data)

In [153]:
print(type(sr))

<class 'pandas.core.series.Series'>

In [154]:
sr

a    1
b    2
c    3
dtype: int64

In [155]:
sr.index

Index(['a', 'b', 'c'], dtype='object')

In [156]:
sr.values

array([1, 2, 3], dtype=int64)

In [157]:
sr.index[0]

'a'

In [158]:
list_data = ['2019-01-02', 3.14, 'ABC', 100, True]
sr = pd.Series(list_data)
print(sr)

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [159]:
sr[1], type(sr[1]) ,sr[1:2],type(sr[1:2])

(3.14,
 float,
 1    3.14
 dtype: object,
 pandas.core.series.Series)

In [160]:
idx = sr.index
val = sr.values

In [161]:
tup_data = ('영인', '2010-05-01', '여', True)
sr = pd.Series(tup_data, index=['이름', '생년월일', '성별', '학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [162]:
print(sr[0]) 
print(sr['이름'])

영인
영인

C:\Users\a\AppData\Local\Temp\ipykernel_12420\1488057053.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(sr[0])

In [163]:
print( sr[[1,2]] )
print('\n')
print(sr[['생년월일', '성별']])
print('\n')

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

C:\Users\a\AppData\Local\Temp\ipykernel_12420\2551614775.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print( sr[[1,2]] )

In [164]:
print( sr[ 1 : 2 ] ) 
print('\n')
print( sr[ '생년월일' : '성별' ] )

생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [165]:
dict_data = {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9], 'c3':[10,11,12], 'c4':[13,14,15]}

In [166]:
df = pd.DataFrame(dict_data)

In [167]:
print(type(df ))
print(df)

<class 'pandas.core.frame.DataFrame'>
   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [168]:
df = pd.DataFrame( [ [15, '남', '덕영중'], [17, '여', '수리중'] ], 
                  index=['준서', '예은'], columns=['나이', '성별', '학교'])

In [169]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [170]:
print(df.index)
print(df.columns)

Index(['준서', '예은'], dtype='object')
Index(['나이', '성별', '학교'], dtype='object')

In [171]:
df.index = ['학생1','학생2']

In [172]:
df

     나이 성별   학교
학생1  15  남  덕영중
학생2  17  여  수리중

In [173]:
df.columns = ['연령','남녀','소속']

In [174]:
df

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

In [175]:
df.rename(columns={'연령':'나이','남녀': 'gender','소속': '학교'},inplace=True)

In [176]:
df

     나이 gender   학교
학생1  15      남  덕영중
학생2  17      여  수리중

In [177]:
df.rename(index={'학생1':'준서','학생2':'연서'},inplace=True)

In [178]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

In [179]:
exam_data

{'수학': [90, 80, 70],
 '영어': [98, 89, 95],
 '음악': [85, 95, 100],
 '체육': [100, 90, 90]}

In [180]:
df = pd.DataFrame(exam_data,index = ['서준','인하','여령'])

In [181]:
df

    수학  영어   음악   체육
서준  90  98   85  100
인하  80  89   95   90
여령  70  95  100   90

In [182]:
df2 = df[:]

In [183]:
df2

    수학  영어   음악   체육
서준  90  98   85  100
인하  80  89   95   90
여령  70  95  100   90

In [184]:
df2.drop('서준')

    수학  영어   음악  체육
인하  80  89   95  90
여령  70  95  100  90

In [185]:
df2.drop(columns=['수학','체육'])

    영어   음악
서준  98   85
인하  89   95
여령  95  100

In [186]:
df3 = df[:]

In [187]:
df3.drop(index =['서준','인하'])

    수학  영어   음악  체육
여령  70  95  100  90

In [188]:
exam_data = {'수학' : [ 90, 80, 70], '영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100], '체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data, index=['서준', '우현', '인아'])

In [189]:
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [190]:
label1 = df.iloc[2]

In [191]:
label1

수학     70
영어     95
음악    100
체육     90
Name: 인아, dtype: int64

In [192]:
position1 = df.iloc[0]

In [193]:
df.iloc[0:2]

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [194]:
df.loc[['서준','인아']]

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100   90

In [195]:
position1

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [196]:
df['수학']

서준    90
우현    80
인아    70
Name: 수학, dtype: int64

In [197]:
exam_data = {'이름' : [ '서준', '우현', '인아'],

'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

In [198]:
df = pd.DataFrame(exam_data)

In [199]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [200]:
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [201]:
math1 = df['수학']

In [202]:
print(math1)

0    90
1    80
2    70
Name: 수학, dtype: int64

In [203]:
print(type(math1))

<class 'pandas.core.series.Series'>

In [204]:
english = df.영어

In [205]:
print(english)

0    98
1    89
2    95
Name: 영어, dtype: int64

In [206]:
print(type(english))

<class 'pandas.core.series.Series'>

In [207]:
music_gym = df[['음악','체육']]

In [208]:
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100   90
<class 'pandas.core.frame.DataFrame'>

In [209]:
df.set_index('이름', inplace=True)
print(df)

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [210]:
a = df.loc['서준', '음악']
print(a)
b = df.iloc[0, 2]
print(b)

85
85

In [211]:
c = df.loc['서준', ['음악', '체육']]
print(c)
d = df.iloc[0, [2, 3]]
print(d)
e = df.loc['서준', '음악':'체육']
print(e)
f = df.iloc[0, 2:]
print(f )
print('\n')

음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64
음악     85
체육    100
Name: 서준, dtype: int64

In [212]:
g = df.loc[['서준', '우현'], ['음악', '체육']]
print(g)
h = df.iloc[[0, 1], [2, 3]]
print(h)
i = df.loc['서준':'우현', '음악':'체육']
print(i)
j = df.iloc[0:2, 2:]
print( j)

    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90
    음악   체육
이름
서준  85  100
우현  95   90

In [213]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [214]:
df['국어'] = 80
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80

In [215]:
df.loc[3] = 0
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0

In [216]:
df.loc[4] = ['동규', 90, 80, 70, 60]

In [217]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60

In [218]:
df.loc['행5'] = df.loc[3]

In [219]:
df

    수학  영어   음악   체육  국어
이름
서준  90  98   85  100  80
우현  80  89   95   90  80
인아  70  95  100   90  80
3    0   0    0    0   0
4   동규  90   80   70  60
행5   0   0    0    0   0

In [228]:
exam_data = {'이름' : [ '서준', '우현', '인아'],

'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}
df = pd.DataFrame(exam_data)

In [229]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100   90

In [232]:
df.set_index(index = '이름', inplace=True)

TypeError: set_index() got an unexpected keyword argument 'index'

In [ ]:
df.loc['이름']

수학   NaN
영어   NaN
음악   NaN
체육   NaN
Name: 이름, dtype: float64

In [ ]:
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100   90

In [ ]:
df.loc['이름'] = None

In [ ]:
df

      수학    영어     음악     체육
이름
서준  90.0  98.0   85.0  100.0
우현  80.0  89.0   95.0   90.0
인아  70.0  95.0  100.0   90.0
이름   NaN   NaN    NaN    NaN

In [ ]:
df.iloc[0][3] = 80

C:\Users\a\AppData\Local\Temp\ipykernel_12420\3723863810.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0][3] = 80
C:\Users\a\AppData\Local\Temp\ipykernel_12420\3723863810.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  df.iloc[0][3] = 80

In [ ]:
df

      수학    영어     음악    체육
이름
서준  90.0  98.0   85.0  80.0
우현  80.0  89.0   95.0  90.0
인아  70.0  95.0  100.0  90.0
이름   NaN   NaN    NaN   NaN

In [ ]:
df.drop('이름')

      수학    영어     음악    체육
이름
서준  90.0  98.0   85.0  80.0
우현  80.0  89.0   95.0  90.0
인아  70.0  95.0  100.0  90.0

In [ ]:
df.loc['서준']['체육'] = 90

C:\Users\a\AppData\Local\Temp\ipykernel_12420\3045965011.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc['서준']['체육'] = 90

In [ ]:
df.loc['서준','체육'] = 99

In [ ]:
df

      수학    영어     음악    체육
이름
서준  90.0  98.0   85.0  99.0
우현  80.0  89.0   95.0  90.0
인아  70.0  95.0  100.0  90.0
이름   NaN   NaN    NaN   NaN

In [ ]:
df.loc['서준',['음악','체육']] = 50

In [ ]:
df

      수학    영어     음악    체육
이름
서준  90.0  98.0   50.0  50.0
우현  80.0  89.0   95.0  90.0
인아  70.0  95.0  100.0  90.0
이름   NaN   NaN    NaN   NaN

In [ ]:
df.loc['서준',['음악','체육']] = 100,50

In [ ]:
df

      수학    영어     음악    체육
이름
서준  90.0  98.0  100.0  50.0
우현  80.0  89.0   95.0  90.0
인아  70.0  95.0  100.0  90.0
이름   NaN   NaN    NaN   NaN